results/redis/load_workload_a.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-01-15 18:54:40:578 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-01-15 18:54:48:029 7 sec: 100000 operations; 13340.45 current ops/sec; [CLEANUP: Count=10, Max=576, Min=40, Avg=117.6, 90=87, 99=576, 99.9=576, 99.99=576] [INSERT: Count=100000, Max=25647, Min=131, Avg=734.76, 90=938, 99=1355, 99.9=3431, 99.99=15839] 
[OVERALL], RunTime(ms), 7496
[OVERALL], Throughput(ops/sec), 13340.448239060832
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 46
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.6136606189967982
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 46
[TOTAL_GC_TIME_%], Time(%), 0.6136606189967982
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 117.6
[CLEANUP], MinLatency(us), 40
[CLEANUP], MaxLatency(us), 576
[CLEANUP], 95thPercentileLatency(us), 576
[CLEANUP], 99thPercentileLatency(us), 576
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 734.76306
[INSERT], MinLatency(us), 131
[INSERT], MaxLatency(us), 25647
[INSERT], 95thPercentileLatency(us), 1048
[INSERT], 99thPercentileLatency(us), 1355
[INSERT], Return=OK, 100000