results/redis/load_workload_b.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-01-15 18:54:53:657 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-01-15 18:55:01:132 7 sec: 100000 operations; 13317.35 current ops/sec; [CLEANUP: Count=10, Max=635, Min=47, Avg=134.4, 90=101, 99=635, 99.9=635, 99.99=635] [INSERT: Count=100000, Max=14959, Min=283, Avg=740.2, 90=955, 99=1583, 99.9=3751, 99.99=10359] 
[OVERALL], RunTime(ms), 7509
[OVERALL], Throughput(ops/sec), 13317.352510320949
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 45
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5992808629644426
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 45
[TOTAL_GC_TIME_%], Time(%), 0.5992808629644426
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 134.4
[CLEANUP], MinLatency(us), 47
[CLEANUP], MaxLatency(us), 635
[CLEANUP], 95thPercentileLatency(us), 635
[CLEANUP], 99thPercentileLatency(us), 635
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 740.20404
[INSERT], MinLatency(us), 283
[INSERT], MaxLatency(us), 14959
[INSERT], 95thPercentileLatency(us), 1083
[INSERT], 99thPercentileLatency(us), 1583
[INSERT], Return=OK, 100000