results/redis/load_workload_c.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2025-12-31 13:48:05:480 0 sec: 0 operations; est completion in 0 second 
2025-12-31 13:48:12:365 6 sec: 100000 operations; 14436.26 current ops/sec; [CLEANUP: Count=10, Max=544, Min=38, Avg=100.5, 90=65, 99=544, 99.9=544, 99.99=544] [INSERT: Count=100000, Max=12447, Min=170, Avg=682.15, 90=843, 99=1184, 99.9=3183, 99.99=9023] 
[OVERALL], RunTime(ms), 6927
[OVERALL], Throughput(ops/sec), 14436.263894904
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 40
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.57745055579616
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 40
[TOTAL_GC_TIME_%], Time(%), 0.57745055579616
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 100.5
[CLEANUP], MinLatency(us), 38
[CLEANUP], MaxLatency(us), 544
[CLEANUP], 95thPercentileLatency(us), 544
[CLEANUP], 99thPercentileLatency(us), 544
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 682.14819
[INSERT], MinLatency(us), 170
[INSERT], MaxLatency(us), 12447
[INSERT], 95thPercentileLatency(us), 938
[INSERT], 99thPercentileLatency(us), 1184
[INSERT], Return=OK, 100000