results/redis/load_workload_d.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
2026-01-15 18:55:20:794 0 sec: 0 operations; est completion in 0 second 
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-01-15 18:55:28:143 7 sec: 100000 operations; 13546.46 current ops/sec; [CLEANUP: Count=10, Max=865, Min=47, Avg=160.7, 90=183, 99=865, 99.9=865, 99.99=865] [INSERT: Count=100000, Max=20655, Min=176, Avg=726.59, 90=925, 99=1296, 99.9=3655, 99.99=10527] 
[OVERALL], RunTime(ms), 7382
[OVERALL], Throughput(ops/sec), 13546.4643727987
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 43
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.582497968030344
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 43
[TOTAL_GC_TIME_%], Time(%), 0.582497968030344
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 160.7
[CLEANUP], MinLatency(us), 47
[CLEANUP], MaxLatency(us), 865
[CLEANUP], 95thPercentileLatency(us), 865
[CLEANUP], 99thPercentileLatency(us), 865
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 726.59453
[INSERT], MinLatency(us), 176
[INSERT], MaxLatency(us), 20655
[INSERT], 95thPercentileLatency(us), 1022
[INSERT], 99thPercentileLatency(us), 1296
[INSERT], Return=OK, 100000