results/redis/load_workload_f.txt
/opt/java/openjdk/bin/java  -classpath /ycsb/conf:/ycsb/lib/HdrHistogram-2.1.4.jar:/ycsb/lib/core-0.17.0.jar:/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/ycsb/lib/jackson-core-asl-1.9.4.jar:/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/ycsb/redis-binding/lib/commons-pool2-2.4.2.jar:/ycsb/redis-binding/lib/jedis-2.9.0.jar:/ycsb/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
Command line: -load -db site.ycsb.db.RedisClient -s -P workloads/workloada -p redis.host=redis -p redis.port=6379 -p recordcount=100000 -p threadcount=10
YCSB Client 0.17.0

Loading workload...
Starting test.
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
2026-01-02 19:57:00:415 0 sec: 0 operations; est completion in 0 second 
2026-01-02 19:57:07:007 6 sec: 100000 operations; 15096.62 current ops/sec; [CLEANUP: Count=10, Max=683, Min=39, Avg=106.4, 90=53, 99=683, 99.9=683, 99.99=683] [INSERT: Count=100000, Max=14023, Min=136, Avg=653.65, 90=785, 99=1174, 99.9=3183, 99.99=8847] 
[OVERALL], RunTime(ms), 6624
[OVERALL], Throughput(ops/sec), 15096.618357487923
[TOTAL_GCS_G1_Young_Generation], Count, 16
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 37
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.5585748792270531
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 37
[TOTAL_GC_TIME_%], Time(%), 0.5585748792270531
[CLEANUP], Operations, 10
[CLEANUP], AverageLatency(us), 106.4
[CLEANUP], MinLatency(us), 39
[CLEANUP], MaxLatency(us), 683
[CLEANUP], 95thPercentileLatency(us), 683
[CLEANUP], 99thPercentileLatency(us), 683
[INSERT], Operations, 100000
[INSERT], AverageLatency(us), 653.64896
[INSERT], MinLatency(us), 136
[INSERT], MaxLatency(us), 14023
[INSERT], 95thPercentileLatency(us), 894
[INSERT], 99thPercentileLatency(us), 1174
[INSERT], Return=OK, 100000